app/views/games/index.html.erb

SELECT "players".* FROM "players" WHERE "players"."id" IN (1, 3)
---
      // 表記揺れ（アクセント無視）かつ部分一致で検索
      const matches = window.playersData.filter(p => {
        // すでに推測済みの選手は除外
        if (window.guessedPlayers.some(g => g.id === p.id)) return false;

        const normalizedName = normalizeString(p.name);
        // 部分一致を許容
        return normalizedName.includes(normalizedVal);
      });

SELECT "players".* FROM "players" WHERE "players"."id" = 1 LIMIT 1
---
    // Enterで直接送信された場合、完全一致を優先し、なければ部分一致で候補を絞る
    let guessedPlayer = window.playersData.find(p =>
      normalizeString(p.name) === normalizedInput
    );