app/controllers/games_controller.rb

  def index
    @players = Player.order(:name)
---
SELECT "players".* FROM "players" ORDER BY "players"."name" ASC